{
  "nav": {
    "homepage": "Homepage",
    "about": "About",
    "project": "Projects",
    "skills": "Skills",
    "contact": "Contact"
  },
  "homepage": {
    "job": "Frontend Developer",
    "presentation": "I’m a Front-end Developer with 3+ years of experience building enterprise-level e-commerce platforms for international brands. Expert in React, Next.js and TypeScript, with strong skills in Web Accessibility.",
    "strengths": "My strengths",
    "card": {
      "card1": "Algorithms",
      "card2": "Development",
      "card3": "Accessibility",
      "card4": "Study"
    },
    "description": "I maintain and implement front end web solutions and architectures, through the writing of optimal algorithms and clean code, to guarantee the website functionalities. I take care of the website performance and web accessibility. I had a strong interest on the Generative AI on which I keep myself updated to learn new technologies.",
    "goToAboutBtn": "Find out more"
  },
  "contact": {
    "title": "Contact me",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "sendMessage": "Send",
    "sent": "The message has been sent. Thank you!",
    "notSent": "The message cannot be sent.",
    "genericError": "Errore d'invio del messaggio."
  },
  "about": {
    "title": "About",
    "paragraph": "I am a Frontend Developer based in Milan, Italy. I have enjoyed turning complex problems into simple, through logic and reasoning. Since 2021 I discovered my passion for web development.",
    "boldParagraph": " Now I do the job I love.",
    "student": "Self-Learner",
    "studentParagraph": "Studying is essential and an integral part of my work. I love studying and learning new things through which I look for new ideas and a continuous personal improvement.",
    "personalProjects": "Personal projects",
    "university": "University",
    "books": "Books & Documentation",
    "curiosity": "Curiosity attitude",
    "geek": "Geek",
    "coder": "Coder",
    "coderParagraph": " Coding is part of my daily life, through this I put into practice what I study. Programming is not just a job, it allows you to learn a way of thinking that makes everyday life easier.",
    "html": "HTML / CSS",
    "git": "Visual Studio Code / Git / Bitbucket ",
    "css": "Bootstrap / Tailwind CSS",
    "js": "JavaScript / TypeScript / C",
    "a11y": "Web Accessibility",
    "next": "Next.js",
    "react": "React JS"
  },
  "prefooter": {
    "goToContactBtn": "Contact me"
  },
  "footer": {
    "sayHello": "Say Hello",
    "sendEmail": "Text Me!",
    "linkdln": "Find me on",
    "siteInfo": "Coded in Visual Studio Code by yours truly. Built with Next.js and Tailwind CSS, deployed with Vercel."
  },
  "card": {
    "algorithms": "Algorithms",
    "development": "Development",
    "a11y": "Accessibility",
    "study": "Study"
  },
  "project": {
    "title": "Projects I have worked on...",
    "luxuryBrand": "Luxury E-commerce",
    "luxuryBrandDesc": "I worked on a luxury e-commerce fashion website for two years allowed me to learn a lot in technical terms, using Salesforce Commerce Cloud as CRM system and React JS and TypeScript as technologies. The demand for continuous maintenance and new improvements enabled me to develop my skills in requirements analysis and understanding customer needs. I also developed logical thinking skills and learned how widely used technologies work. The required quality was very high, leading to meticulous attention to detail and continuous testing after development. Teamwork was also essential, with continuous updates and daily alignment on our activities. The willingness of each team member to learn and grow, as well as the great mutual respect we had for each other, definitely made us an excellent team.",
    "cosmeticBrand": "Cosmetic E-commerce",
    "cosmeticBrandDesc": "I am currently working on a well-known cosmetics e-commerce platform. Here, I had the chance to explore new technologies such as Next.js and adopt a cleaner, more streamlined deployment system with Vercel. While I continue to use React.js with TypeScript, I have discovered a more modern and innovative way of working thanks to the headless architecture of the project, where the frontend is decoupled and the backend is managed by the EVA platform. My responsibilities include performance optimization, site accessibility, building new components, fixing bugs, and managing API integrations with external services. This has allowed me to develop a strong problem-solving mindset while ensuring the site remains both scalable and user-friendly.",
    "a11y": "Accessibility",
    "a11yDesc": "On several projects, I have been personally responsible for Web Accessibility. I perform detailed audits to identify accessibility issues, classify them according to WCAG 2.2 guidelines, and propose possible solutions. As part of this process, I create detailed audit reports, organizing issues in spreadsheets that include key parameters such as: which WCAG criterion is violated, severity level, impact on development or design, and suggested technical fixes. I frequently collaborate with the development team to guide them in resolving accessibility problems. For testing, I primarily use VoiceOver to navigate both node by node and via keyboard tabbing, ensuring the site is accessible to all users. This hands-on work has deepened my understanding of inclusive design and reinforced the importance of accessibility in every stage of web development."
  },
  "A11y": {
    "translateIT": "Translate in Italian",
    "translateEN": "Translate in English",
    "swipeup": "Swipe up"
  },
  "error": {
    "title": "Ops! Something went wrong",
    "paragraph": "An unexpected error occurred. Please try again.",
    "retry": " Retry",
    "home": "Go Home"
  }
}
