{
  "nav": {
    "homepage": "Homepage",
    "about": "Su di me",
    "project": "Progetti",
    "contact": "Contatti"
  },
  "homepage": {
    "job": "Sviluppatrice Frontend",
    "presentation": "Sono una sviluppatrice front-end appassionata di tutto ciò che orbita il mondo scientifico e informatico. Mi occupo di siti web e-commerce, nel settore luxury and fashion e  beauty and cosmetics.",
    "strengths": "Punti di forza",
    "card": {
      "card1": "Algoritmi",
      "card2": "Sviluppo",
      "card3": "Accessibilità",
      "card4": "Studio"
    },
    "description": "Mantengo e implemento soluzioni e architetture web front-end, attraverso la scrittura di algoritmi ottimali e codice pulito, per garantire le funzionalità del sito web. Mi occupo delle performance del sito e dell'accessibilità web. Ho un forte interesse per l'intelligenza artificiale sulla quale mi tengo aggiornata per continuare ad apprendere nuove tecnologie con un orientamento al futuro.",
    "goToAboutBtn": "Scopri di più"
  },
  "contact": {
    "title": "Contattami",
    "name": "Nome",
    "email": "Email",
    "message": "Messaggio",
    "sendMessage": "Invia",
    "sent": "Il messaggio è stato inviato. Grazie!",
    "notSent": "Il messaggio non puù essere inviato.",
    "genericError": "Error sending message."
  },
  "about": {
    "title": "Su di me",
    "paragraph": "Sono una sviluppatrice frontend con sede a Milano, Italia. Mi piace trasformare problemi complessi in semplici attraverso la logica e il ragionamento. Dal 2021 ho scoperto la mia passione per lo sviluppo web.",
    "boldParagraph": " Ora faccio il lavoro che amo.",
    "student": "Studente",
    "studentParagraph": "Lo studio è essenziale e parte integrante del mio lavoro. Amo studiare e imparare cose nuove attraverso le quali cerco nuovi spunti e un continuo miglioramento personale.",
    "personalProjects": "Progetti personali",
    "university": "Università",
    "books": "Libri & Documentazione",
    "curiosity": "Curiosità",
    "geek": "Geek",
    "coder": "Programmatrice",
    "coderParagraph": "Il coding fa parte della mia vita quotidiana, attraverso questo metto in pratica ciò che studio. Programmare non è solo un lavoro, ti permette di apprendere un modo di pensare che semplifica la vita di tutti i giorni.",
    "html": "HTML / CSS",
    "git": "Visual Studio Code / Git / Bitbucket ",
    "css": "Bootstrap / Tailwind CSS",
    "js": "JavaScript / TypeScript / C",
    "a11y": "Accessibilità Web",
    "next": "Next.js",
    "react": "React JS"
  },
  "prefooter": {
    "goToContactBtn": "Contattami"
  },
  "footer": {
    "sayHello": "Say Hello",
    "sendEmail": "Mandami un'email!",
    "linkdln": "Trovami su",
    "siteInfo": "Sviluppato con Visual Studio Code. Costruito con Next.js e Tailwind CSS, distribuito con Vercel."
  },
  "card": {
    "algorithms": "Algoritmi",
    "development": "Sviluppo",
    "a11y": "Accessibilità",
    "study": "Studio"
  },
  "project": {
    "title": "Progetti su cui ho lavorato...",
    "luxuryBrand": "E-commerce di lusso",
    "luxuryBrandDesc": "I worked on a luxury e-commerce fashion website for two years (a luxury fashion brand) allowed me to learn a lot in technical terms, using Salesforce Commerce Cloud as CRM system and React JS and TypeScript as technologies. The demand for continuous maintenance and new improvements enabled me to develop my skills in requirements analysis and understanding customer needs. I also developed logical thinking skills and learned how widely used technologies work. The required quality was very high, leading to meticulous attention to detail and continuous testing after development. Teamwork was also essential, with continuous updates and daily alignment on our activities. The willingness of each team member to learn and grow, as well as the great mutual respect we had for each other, definitely made us an excellent team.",
    "cosmeticBrand": "E-commerce di cosmetica e bellezza",
    "cosmeticBrandDesc": "I'm working on a famous cosmetic e-commerce. Here, I had the opportunity to learn new technologies such as Next.Js and a cleaner and more streamlined deployment system using Vercel. I am continuing to use React with Typescript, but I have discovered a more modern and innovative way of working.",
    "a11y": "Accessibilità",
    "a11yDesc": "On some other projects, I am personally responsible for Web Accessibility. I perform audits in which I analyze all accessibility bugs and identify problems and possible solutions, in agreement with the development team and following the WCAG 2.2."
  },
  "A11y": {
    "translateIT": "Traduci in Italiano",
    "translateEN": "Traduci in Inglese"
  },
  "error": {
    "title": "Ops! Qualcosa è andato storto",
    "paragraph": "Si è verificato un errore imprevisto. Si prega di riprovare.",
    "retry": " Riprova",
    "home": "Torna alla Homepage"
  }
}
